{
  "text": "Adozillion Real Estate unveils Monte Carlo City Lagos to bring nature, exciting world experiences and luxury into one estate. <br/> <br/> Adozillion homes and realty is one of the fastest growing real estate firm in Lagos with mission of building functional world class structures you can always trust. <br/> <br/> Monte Carlo is a city of Glitz and Glamour located in Lagos Cit, Epe.An eco friendly estate, immersed in an entirely green environment where you sit at the comfort of nature and ease the bustles and hustles of Lagos state and experience the entire world in one estate. <br/> <br/> Monte Carlo Lagos is sandwiched in a closed proximity to advanced modern development and private corporations including the proposed Lekki Epe International Airport etc. Facilities in this estate are carefully created and curated to surpass the needs and expectations of residents and business entities. Some of the facility the estate features are, themed building hubs,Arcade Centres, resort beach house, hotels apartments, marine bay and many others. It is equally equipped with top notch round the clock smart securities, solar power energy, paved roads, treated and and constant water supply, modern drainages etc. Dr Simon Adozi, the Chief Executive Officer of Adozillion Homes and Realty has assured that about 50% of the Monte Carlo is expected to be fully built by 2025 and urged Nigerians to take advantage and Key into this project. <br/> <br/> He said this during the first inspection of the Monte Carlo Lagos on 13th December 2022, which had in attendance, investors, real estate enthusiasts, and key players in the sector. Whom at the end of the unveiling expressed their happiness and were happy and commended the giant strides of the Adozillion Homes and Realty. <br/> <br/> Following our brands vision statement to be the leading real estate solution company of choice with unmatched focus on customer satisfaction,we have strategized a means of solution and satisfying our customers through setting a pre launch price of 50,000/Sqm and it is available in 150Sqm, 300Sqm, 500Sqm and 1000Sqm, that is 7.5million, 15million, 25million and 50million respectively and has its title as the Governors consent. <br/> <br/>We are set to begin construction of Monte Carlo in ernest very soon with lands continuously allocated to owners accordingly.<br/><br/>This is a big opportunity for Nigerians to become owners of property, with payment plans spread across 12months, Dr Simon said.<br/> <br/> We are redefining real estate in Nigeria through bring nature to live in one estate."
}
